# Приклад програми від www.sapphiresteel.com

puts("початок 1-го циклу while")
# Він виконається 0 або більше разів
i = 10
while i < 10
  puts(i)
  i += 1
end
puts("1-й цикл while завершився")

i = 10
puts("\nпочаток 2-го циклу while")
# Він виконається 1 або більше разів
begin
  puts(i)
  i += 1
end while i < 10
puts("2-й цикл while завершився")

x = 100
# Код у 3-у циклі ніколи не виконається
while (x < 100) do puts('цикл 3: x < 100') end

# Код у 4-у циклі ніколи не виконається
puts('цикл 4: x < 100') while (x < 100)

# Код у 5-у циклі ніколи не виконається
begin puts('цикл 5: x < 100') end while (x < 100)
