
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Вступ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="01-Strings-and-Methods.html" />
    
    
    <link rel="prev" href="../" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/thelittlebookofruby","types":["star"],"size":"small"};
    </script>

    <link href="http://lambdabooks.github.io/thelittlebookofruby/rss.xml" title="Маленька книга про Ruby" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Маленька книжка про Ruby
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Strings-and-Methods.html">
            
                <a href="01-Strings-and-Methods.html">
            
                    
                    Глава 1: Рядки та методи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Classes-and-Objects.html">
            
                <a href="02-Classes-and-Objects.html">
            
                    
                    Глава 2: Класи та об’єкти
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    Глава 3: Класова ієрархія
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    Глава 4: Аксесори, атрибути, змінні класів
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    Глава 5: Масиви
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    Глава 6: Хеші
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    Глава 7: Цикли та ітератори
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    Глава 8: Умовні оператори
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" >
            
                <span>
            
                    
                    Глава 9: Модулі та домішки
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" >
            
                <span>
            
                    
                    Глава 10: Збереження файлів, продовження…
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Вступ</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43B;&#x430;&#x441;&#x43A;&#x430;&#x432;&#x43E;-&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43C;&#x43E;-&#x443;-&#xAB;&#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x443;-&#x43A;&#x43D;&#x438;&#x433;&#x443;-&#x43F;&#x440;&#x43E;-ruby&#xBB;">&#x41B;&#x430;&#x441;&#x43A;&#x430;&#x432;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43C;&#x43E; &#x443; &#xAB;&#x41C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x443; &#x43A;&#x43D;&#x438;&#x433;&#x443; &#x43F;&#x440;&#x43E; Ruby&#xBB;</h1>
<h2 id="&#x43E;&#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x442;&#x435;&#x441;&#x44C;-&#x437;-ruby-&#x437;&#x430;-&#x434;&#x435;&#x441;&#x44F;&#x442;&#x44C;-&#x433;&#x43B;&#x430;&#x432;">&#x41E;&#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x442;&#x435;&#x441;&#x44C; &#x437; Ruby &#x437;&#x430; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x44C; &#x433;&#x43B;&#x430;&#x432;</h2>
<ul>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 1: &#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 2: &#x41A;&#x43B;&#x430;&#x441;&#x438; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 3: &#x41A;&#x43B;&#x430;&#x441;&#x43E;&#x432;&#x430; &#x456;&#x454;&#x440;&#x430;&#x440;&#x445;&#x456;&#x44F;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 4: &#x410;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438;, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 5: &#x41C;&#x430;&#x441;&#x438;&#x432;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 6: &#x425;&#x435;&#x448;&#x456;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 7: &#x426;&#x438;&#x43A;&#x43B;&#x438; &#x442;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 8: &#x423;&#x43C;&#x43E;&#x432;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 9: &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x442;&#x430; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438;</li>
<li>&#x413;&#x43B;&#x430;&#x432;&#x430; 10: &#x417;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432;, &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x435;&#x43D;&#x43D;&#x44F;</li>
</ul>
<h2 id="&#x449;&#x43E;-&#x442;&#x430;&#x43A;&#x435;-ruby">&#x429;&#x43E; &#x442;&#x430;&#x43A;&#x435; Ruby?</h2>
<p>Ruby &#x2014; &#x446;&#x435; &#x43A;&#x440;&#x43E;&#x441;&#x2013;&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x43D;&#x430; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x430;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x201C;&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x432;&#x438;&#x43C;&#x438;&#x201D; &#x43C;&#x43E;&#x432;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x43E;&#x442; Perl &#x447;&#x438; Python. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x457;&#x457; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x457; &#x43E;&#x440;&#x456;&#x454;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x440;&#x435;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x456;, &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x43C;&#x430;&#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x430;&#x440;&#x43E;&#x434;&#x438;&#x447;&#x435;&#x43C; &#x201C;&#x447;&#x438;&#x441;&#x442;&#x438;&#x445;&#x201D; &#x41E;&#x41E;&#x41F; &#x43C;&#x43E;&#x432;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x43C;&#x43E;&#x432;&#x43E;&#x44E; Smalltalk. Ruby &#x431;&#x443;&#x43B;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x42E;&#x43A;&#x456;&#x445;&#x456;&#x440;&#x43E; &#x41C;&#x430;&#x446;&#x443;&#x43C;&#x43E;&#x442;&#x43E; (Yukihiro Matsumoto) (&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x434; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43D;&#x456;&#x43C;&#x43E;&#x43C; &#x41C;&#x435;&#x442;&#x446; (Matz)) &#x456; &#x432;&#x43F;&#x435;&#x440;&#x448;&#x435; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x443; 1995&#x2013;&#x443;.</p>
<h2 id="&#x449;&#x43E;-&#x442;&#x430;&#x43A;&#x435;-rails">&#x429;&#x43E; &#x442;&#x430;&#x43A;&#x435; Rails?</h2>
<p>&#x421;&#x44C;&#x43E;&#x433;&#x43E;&#x434;&#x43D;&#x456; &#x440;&#x43E;&#x437;&#x43C;&#x43E;&#x432;&#x438; &#x43F;&#x440;&#x43E; Ruby &#x437;&#x434;&#x435;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x443; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; Rails, &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; Ruby On Rails. &#x425;&#x43E;&#x447;&#x430; Rails &#x454; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x43E;&#x43C; &#x456;&#x437; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x438;&#x43C;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; Ruby &#x43D;&#x435; &#x437;&#x430;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x430; &#x43D;&#x44C;&#x43E;&#x43C;&#x443;. &#x411;&#x435;&#x437; &#x441;&#x443;&#x43C;&#x43D;&#x456;&#x432;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x435; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x437;&#x430;&#x433;&#x43B;&#x438;&#x431;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43A;&#x443; &#x43D;&#x430; Rails &#x431;&#x435;&#x437; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x43E;&#x43B;&#x43E;&#x434;&#x456;&#x43D;&#x43D;&#x44F; Ruby, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x435;&#x448;&#x442;&#x43E;&#x44E; &#x43E;&#x43F;&#x438;&#x43D;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x457;, &#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x454;&#x442;&#x435; &#x441;&#x432;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443;. &#xAB;&#x41C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x430; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x43F;&#x43E; Ruby&#xBB; &#x43D;&#x435; &#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x454; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; Rails, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x435; &#x43F;&#x456;&#x434;&#x491;&#x440;&#x443;&#x43D;&#x442;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x43A;&#x43E;&#x434;&#x443; &#x43D;&#x430; Rails &#x442;&#x430; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x430;&#x448;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; Rails&#x2013;&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432;.</p>
<h2 id="&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;-&#x442;&#x430;-&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-ruby-&#x440;&#x430;&#x437;&#x43E;&#x43C;-&#x437;-ruby-in-steel">&#x412;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; Ruby &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x437; Ruby In Steel</h2>
<p>Ruby In Steel &#x2014; &#x446;&#x435; IDE &#x434;&#x43B;&#x44F; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x438; Windows, &#x44F;&#x43A;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x456;&#x43D;&#x441;&#x442;&#x430;&#x43B;&#x44F;&#x442;&#x43E;&#x440;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; Ruby, Visual Studio, Ruby In Steel &#x442;&#x430; &#x456;&#x43D;&#x448;&#x456; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x438;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438; Rails. &#x41F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44C;, &#x449;&#x43E; &#x432;&#x438; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x43B;&#x438; &#x43A;&#x435;&#x440;&#x456;&#x432;&#x43D;&#x438;&#x446;&#x442;&#x432;&#x43E; &#x437; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x43D;&#x44F;: <a href="http://www.sapphiresteel.com" target="_blank">http://www.sapphiresteel.com</a>.</p>
<h2 id="&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E;-ruby-&#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;">&#x412;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E; Ruby &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;</h2>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x44F;&#x43A;&#x435;&#x441;&#x44C; &#x456;&#x43D;&#x448;&#x435; IDE &#x430;&#x431;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x439;&#x441;&#x432;&#x456;&#x436;&#x456;&#x448;&#x443; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44E; Ruby &#x437; &#x441;&#x430;&#x439;&#x442;&#x443; <a href="http://www.ruby-lang.org/" target="_blank">www.ruby-lang.org</a>. &#x41F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44C;, &#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; (&#x430; &#x43D;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;).</p>
<h2 id="&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438;-&#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439;-&#x43A;&#x43E;&#x434;-&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x2013;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;">&#x41E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x2013;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;</h2>
<p>&#x412;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x437; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438; &#x446;&#x456;&#x454;&#x457; &#x43A;&#x43D;&#x438;&#x433;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; zip&#x2013;&#x430;&#x440;&#x445;&#x456;&#x432;&#x443; &#x437;: <a href="http://www.sapphiresteel.com/ruby-programming/The-Little-Book-Of-Ruby.html" target="_blank">http://www.sapphiresteel.com/ruby-programming/The-Little-Book-Of-Ruby.html</a>. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x430;&#x440;&#x445;&#x456;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x435;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x437;&#x433;&#x440;&#x443;&#x43F;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x43F;&#x43E; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x456;&#x44F;&#x445;: &#x43F;&#x43E; &#x43E;&#x434;&#x43D;&#x456;&#x439; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; Ruby In Steel, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x443;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x44F;&#x43A; &#x43E;&#x434;&#x43D;&#x435; &#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x437; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x437; &#x433;&#x43B;&#x430;&#x432; &#x43D;&#x430; &#x433;&#x456;&#x43B;&#x43A;&#x430;&#x445; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x443; &#x432;&#x456;&#x43A;&#x43D;&#x456; &#xAB;Project Manager&#xBB;.</p>
<h2 id="&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;-&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;-&#x43D;&#x430;-ruby">&#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C; &#x43D;&#x430; Ruby</h2>
<p>&#x417;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;, &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x43E; &#x43C;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x442;&#x435; &#x432;&#x456;&#x43A;&#x43D;&#x43E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x443; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x456;&#x457;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C; &#x43D;&#x430; Ruby. &#x42F;&#x43A;&#x449;&#x43E; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440; Ruby &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x443; &#x432;&#x430;&#x448;&#x456;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x456;, &#x432;&#x438; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;, &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x432;&#x448;&#x438; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; <code>ruby &lt;program name&gt;</code> &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-roby">ruby 1helloworld.rb
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; Ruby In Steel, &#x432;&#x438; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x443; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456;, &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43D;&#x443;&#x432;&#x448;&#x438; <kbd>CTRL+F5</kbd> &#x430;&#x431;&#x43E; (&#x443; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445;) &#x2014; &#x443; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x436;&#x443;&#x432;&#x430;&#x447;&#x456; (debugger), &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43D;&#x443;&#x432;&#x448;&#x438; <kbd>F5</kbd>.</p>
<h2 id="&#x44F;&#x43A;-&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;-&#x446;&#x456;&#x454;&#x44E;-&#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x44E;">&#x42F;&#x43A; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x446;&#x456;&#x454;&#x44E; &#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x44E;</h2>
<p>&#x426;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x454; &#x43F;&#x43E;&#x43A;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x43F;&#x43E;&#x441;&#x456;&#x431;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x437; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; Ruby, &#x437;&#x430; &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434; &#x433;&#x43B;&#x430;&#x432;&#x438; &#x434;&#x43E; &#x433;&#x43B;&#x430;&#x432;&#x438;, &#x447;&#x438;&#x442;&#x430;&#x44E;&#x447;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x442;&#x430; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;. &#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x430;&#x434;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x443; &#x201C;&#x43F;&#x43E;&#x433;&#x43B;&#x438;&#x431;&#x43B;&#x435;&#x43D;&#x43D;&#x44E;&#x201D; &#x432; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x456;&#x430;&#x43B;, &#x442;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x456;&#x431;&#x440;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;&#x43C;&#x438; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x44C; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x456;. &#x423; &#x446;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x437;&#x456; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43C;&#x43E;&#x43D;&#x43E;&#x43B;&#x456;&#x442;&#x43D;&#x438;&#x445; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432;, &#x430; &#x43B;&#x438;&#x448;&#x435; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x456;, &#x441;&#x430;&#x43C;&#x43E;&#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x433;&#x43B;&#x430;&#x432;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;&#x2026;</p>
<h2 id="&#x443;&#x43C;&#x43E;&#x432;&#x43D;&#x456;-&#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;">&#x423;&#x43C;&#x43E;&#x432;&#x43D;&#x456; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x423; &#xAB;&#x41C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x436;&#x446;&#x456; &#x43F;&#x440;&#x43E; Ruby&#xBB;, &#x432;&#x441;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x43D;&#x430; Ruby &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-ruby"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">saysomething</span></span>
  puts( <span class="hljs-string">&quot;Hello&quot;</span> )
<span class="hljs-keyword">end</span>
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x454; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;&#x2013;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x456;&#x43C;&#x2019;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x43F;&#x43E;&#x440;&#x443;&#x447; &#x442;&#x430; &#x432;&#x438;&#x434;&#x456;&#x43B;&#x435;&#x43D;&#x43E; <strong><code>&#x436;&#x438;&#x440;&#x43D;&#x438;&#x43C; &#x43C;&#x43E;&#x43D;&#x43E;&#x448;&#x438;&#x440;&#x43D;&#x438;&#x43C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x43C;</code></strong> &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<p><strong><code>helloname.rb</code></strong></p>
<p>&#x420;&#x43E;&#x437;&#x2019;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x456; (&#x44F;&#x43A;&#x456; &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x43D;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x430;&#x434;&#x438; &#x430;&#x431;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x433;&#x43B;&#x438;&#x431;&#x43E;&#x43A;&#x435; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x44E;&#x430;&#x43D;&#x441;&#x456;&#x432;, &#x437;&#x433;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x456;) &#x432;&#x438;&#x434;&#x456;&#x43B;&#x435;&#x43D;&#x456; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<blockquote>
<p>&#x426;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x440;&#x43E;&#x437;&#x2019;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x435;&#x2026;!</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Маленька книжка про Ruby">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="01-Strings-and-Methods.html" class="navigation navigation-next " aria-label="Next page: Глава 1: Рядки та методи">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Вступ","level":"1.2","depth":1,"next":{"title":"Глава 1: Рядки та методи","level":"1.3","depth":1,"path":"chapters/01-Strings-and-Methods.md","ref":"chapters/01-Strings-and-Methods.md","articles":[]},"previous":{"title":"Маленька книжка про Ruby","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{},"github":{"url":"https://github.com/LambdaBooks/thelittlebookofruby"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Маленька книга про Ruby","description":"Український переклад книги «The Little Book Of Ruby».","author":"Denys Dovhan","site_url":"http://lambdabooks.github.io/thelittlebookofruby","feed_url":"http://lambdabooks.github.io/thelittlebookofruby/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/thelittlebookofruby","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-8"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/thelittlebookofruby/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/00-Introduction.md","mtime":"2017-02-12T14:41:21.992Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-12T14:42:44.565Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

