
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 1: Рядки та методи · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02-Classes-and-Objects.html" />
    
    
    <link rel="prev" href="00-Introduction.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/thelittlebookofruby","types":["star"],"size":"small"};
    </script>

    <link href="http://lambdabooks.github.io/thelittlebookofruby/rss.xml" title="Маленька книга про Ruby" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Маленька книжка про Ruby
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="01-Strings-and-Methods.html">
            
                <a href="01-Strings-and-Methods.html">
            
                    
                    Глава 1: Рядки та методи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Classes-and-Objects.html">
            
                <a href="02-Classes-and-Objects.html">
            
                    
                    Глава 2: Класи та об’єкти
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    Глава 3: Класова ієрархія
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    Глава 4: Аксесори, атрибути, змінні класів
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    Глава 5: Масиви
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" >
            
                <span>
            
                    
                    Глава 6: Хеші
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    Глава 7: Цикли та ітератори
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    Глава 8: Умовні оператори
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" >
            
                <span>
            
                    
                    Глава 9: Модулі та домішки
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" >
            
                <span>
            
                    
                    Глава 10: Збереження файлів, продовження…
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 1: Рядки та методи</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x440;&#x44F;&#x434;&#x43A;&#x438;-&#x442;&#x430;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h1>
<blockquote>
<p>&#x423; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43C;&#x438; &#x43F;&#x43E;&#x433;&#x440;&#x430;&#x454;&#x43C;&#x43E;&#x441;&#x44C; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;, &#x434;&#x43E;&#x434;&#x430;&#x43C;&#x43E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x440;&#x43E;&#x437;&#x431;&#x435;&#x440;&#x435;&#x43C;&#x43E;&#x441;&#x44C; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x43C;&#x43E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x443;&#x43C;&#x43E;&#x432;&#x2026;</p>
</blockquote>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x447;&#x438;&#x442;&#x430;&#x454;&#x442;&#x435; &#x446;&#x44E; &#x43A;&#x43D;&#x438;&#x433;&#x443;, &#x442;&#x43E;, &#x43C;&#x430;&#x431;&#x443;&#x442;&#x44C;, &#x43C;&#x430;&#x454;&#x442;&#x435; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43E;&#x432;&#x43E;&#x44E; Ruby, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x43D;&#x430; &#x43C;&#x435;&#x43D;&#x435; &#x2014; &#x432;&#x430;&#x43C; &#x432;&#x436;&#x435; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x457;&#x457;. &#x429;&#x43E; &#x436;, &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C;&#x43E; &#x432;&#x438;&#x442;&#x440;&#x430;&#x447;&#x430;&#x442;&#x438; &#x447;&#x430;&#x441; &#x434;&#x430;&#x440;&#x43C;&#x430;. &#x42F; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x432;&#x436;&#x435; &#x454; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x430; Ruby, &#x44F;&#x43A;&#x449;&#x43E; &#x436; &#x43D;&#x456; - &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x456;&#x442;&#x44C; &#x457;&#x457; &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x44E;&#x434;&#x438;.</p>
<blockquote>
<p><strong>&#x412;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;:</strong> &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; Ruby In Steel, &#x432;&#x43F;&#x435;&#x432;&#x43D;&#x456;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x43B;&#x438; &#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; LittleBookOfRuby.sln for easy access to all the sample programs.</p>
</blockquote>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438;. &#x412;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x439;&#x442;&#x435; &#x432;&#x430;&#x448; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x456;&#x442;&#x44C; &#x444;&#x430;&#x439;&#x43B; &#x442;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x448;&#x456;&#x442;&#x44C; &#x432; &#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<p><strong><code>helloworld.rb</code></strong>:</p>
<pre><code class="lang-ruby">puts <span class="hljs-string">&quot;hello world&quot;</span>
</code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x456;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443; (&#x443; Ruby In Steel &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43D;&#x456;&#x442;&#x44C; <kbd>CTRL-F5</kbd>). &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;, Ruby &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#xAB;hello world&#xBB;:</p>
<blockquote>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x43C; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x457; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x439;&#x442;&#x435; &#x432;&#x456;&#x43A;&#x43D;&#x43E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; (&#x432;&#x432;&#x435;&#x434;&#x456;&#x442;&#x44C; <code>CMD</code> &#x443; &#x43C;&#x435;&#x43D;&#x44E; &#xAB;&#x41F;&#x443;&#x441;&#x43A;&#xBB; &#x43D;&#x430; Windows) &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x434;&#x456;&#x442;&#x44C; &#x443; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x456;&#x44E;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x432;&#x435;&#x434;&#x456;&#x442;&#x44C; <code>ruby</code> &#x442;&#x430; &#x43D;&#x430;&#x437;&#x432;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-bash">$ ruby helloworld.rb
</code></pre>
</blockquote>
<p>&#x426;&#x435; &#x43D;&#x430;&#x43F;&#x435;&#x432;&#x43D;&#x43E; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x430;&#x439;&#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x448;&#x430; &#x201C;hello world&#x201D;&#x2013;&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; &#x432; &#x456;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x457; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x438; &#x43E;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x434;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x432;&#x456;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430;&#x2026;</p>
<p>&#x41E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x438;&#x439; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x440;&#x43E;&#x43A; &#x2014; &#x43C;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x201C;&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438;&#x201D; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x412;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x432;&#x436;&#x435; &#x437;&#x434;&#x43E;&#x433;&#x430;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x432; Ruby &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>.gets</code>.</p>
<blockquote>
<h2 id="&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x438;-&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x41E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438; &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h2>
<p>Ruby &#x2014; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x43D;&#x43E; &#x43E;&#x440;&#x456;&#x454;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412;&#x441;&#x435;: &#x432;&#x456;&#x434; &#x446;&#x438;&#x444;&#x440;&#x438; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x2014; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x43E;&#x43C;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x43C;&#x430;&#x454; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x438;&#x445;&#x43E;&#x441;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; &#x456; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x442;&#x443;&#x442; &#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>.upcase</code>  &#x449;&#x43E;&#x431; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x201C;hello world&#x201D; &#x443; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x433;&#x456;&#x441;&#x442;&#x440;&#x456;:</p>
<p><strong><code>uppercase.rb</code></strong>:</p>
<pre><code class="lang-ruby">puts <span class="hljs-string">&quot;hello world&quot;</span>.upcase
</code></pre>
<p>&#x414;&#x435;&#x44F;&#x43A;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x442;&#x430;&#x43A;&#x456; &#x44F;&#x43A; <code>puts</code> &#x456; <code>.gets</code>  &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x441;&#x43A;&#x440;&#x456;&#x437;&#x44C;, &#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x443; &#x437; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;. &#x42F;&#x43A;&#x449;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x447;&#x43D;&#x43E;&#x44E; &#x43C;&#x43E;&#x432;&#x43E;&#x44E; &#x2014; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x43C; &#x44F;&#x434;&#x440;&#x430; Ruby &#x456; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x456; &#x434;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; &#x446;&#x456;&#x454;&#x457; &#x43C;&#x43E;&#x432;&#x438;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43E;&#x43A; &#x43D;&#x430; Ruby &#x2014; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43D;&#x438;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x42F;&#x434;&#x440;&#x430;.</p>
</blockquote>
<p>&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430; <strong><code>helloname.rb</code></strong> &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x442;&#x430;&#x442;&#x438; &#x432; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430; &#x439;&#x43E;&#x433;&#x43E; &#x456;&#x43C;&apos;&#x44F;. &#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x446;&#x435; &#x201C;Fred&#x201D; &#x2014; &#x442;&#x43E;&#x434;&#x456; &#x43D;&#x430; &#x43C;&#x43E;&#x43D;&#x456;&#x442;&#x43E;&#x440;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x43E; &#x437;&apos;&#x44F;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x456;&#x442;&#x430;&#x43D;&#x43D;&#x44F;: &#x201C;Hello Fred&#x201D;. &#x41E;&#x441;&#x44C; &#x457;&#x457; &#x43A;&#x43E;&#x434;:</p>
<p><strong><code>helloname.rb</code></strong>:</p>
<pre><code class="lang-ruby">print <span class="hljs-string">&apos;Enter your name:&apos;</span>
name = gets
puts <span class="hljs-string">&quot;Hello <span class="hljs-subst">#{name}</span>&quot;</span>
</code></pre>
<p>&#x426;&#x435; &#x432;&#x441;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x430;&#x43B;&#x435; &#x432;&#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x448;&#x435; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x438; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43D;&#x44E;&#x430;&#x43D;&#x441;&#x438;. &#x41F;&#x43E;&#x2013;&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x437;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x432; <code>print</code>, &#x430; &#x43D;&#x435; <code>puts</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x442;&#x443; &#x43D;&#x430; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x43C;&#x435;&#x43D;&#x456;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>puts</code> &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x43E;&#x441;&#x443; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; <code>print</code>, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C;. &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x44F; &#x445;&#x43E;&#x447;&#x443;, &#x449;&#x43E;&#x431; &#x43A;&#x443;&#x440;&#x441;&#x43E;&#x440; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x432;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x449;&#x43E; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x442; &#x432;&#x432;&#x43E;&#x434;&#x443; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;.</p>
<p>&#x412; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E; <code>gets()</code> &#x434;&#x43B;&#x44F; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E;&#x457; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x435;&#x43C; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x432;&#x456;&#x448;&#x456; Enter. &#x426;&#x435;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>name</code>. &#x42F; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x432; &#x446;&#x456;&#x454;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x456; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x43D;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x432; &#x457;&#x457; &#x442;&#x438;&#x43F;. &#x412; Ruby &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;, &#x456; &#x432;&#x43E;&#x43D;&#x430; &#x441;&#x430;&#x43C;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x44C; &#x457;&#x445;&#x43D;&#x456;&#x439; &#x442;&#x438;&#x43F;. &#x422;&#x443;&#x442; &#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x432; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>name</code> &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x456; Ruby &#x441;&#x430;&#x43C;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x43B;&#x430;, &#x449;&#x43E; &#x442;&#x438;&#x43F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x431;&#x443;&#x442;&#x438; string.</p>
<blockquote>
<p><strong>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;:</strong> Ruby &#x447;&#x443;&#x442;&#x43B;&#x438;&#x432;&#x430; &#x434;&#x43E; &#x440;&#x435;&#x433;&#x456;&#x441;&#x442;&#x440;&#x443;. &#x422;&#x43E;&#x431;&#x442;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>myvar</code> &#x456; <code>myVar</code> &#x2013; &#x434;&#x432;&#x456; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x442;&#x430;&#x43A;&#x456; &#x44F;&#x43A; <code>name</code>  &#x443; &#x43D;&#x430;&#x448;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x2013; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x437; &#x43C;&#x430;&#x43B;&#x43E;&#x457; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x438;.</p>
</blockquote>
<p>&#x41C;&#x456;&#x436; &#x456;&#x43D;&#x448;&#x438;&#x43C;, &#x434;&#x443;&#x436;&#x43A;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>gets()</code> &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x456;, &#x44F;&#x43A; &#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;, &#x449;&#x43E; &#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x44E;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>print</code> &#x442;&#x430; <code>puts</code>: &#x43A;&#x43E;&#x434; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x435; &#x434;&#x443;&#x436;&#x43A;&#x438;. &#x412;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x434;&#x432;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432; &#x43A;&#x43E;&#x434;&#x456; &#x456;, &#x432; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x438;&#x442;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x441;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x457;&#x445; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435;. &#x414;&#x435;&#x44F;&#x43A;&#x456; Ruby&#x2013;&#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x43B;&#x44E;&#x431;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x2014; &#x44F; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x456;&#x43B;&#x44F;&#x44E; &#x457;&#x445;&#x43D;&#x44C;&#x43E;&#x457; &#x434;&#x443;&#x43C;&#x43A;&#x438;. &#x422;&#x43E;&#x43C;&#x443; &#x432; &#x446;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x437;&#x456; &#x432;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x431;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x43A;&#x43E;&#x434;&#x443; &#x441;&#x430;&#x43C;&#x435; &#x437; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438;.</p>
<h2 id="&#x440;&#x44F;&#x434;&#x43A;&#x438;-&#x442;&#x430;-&#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x43E;&#x43B;&#x44F;&#x446;&#x456;&#x44F;">&#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x43E;&#x43B;&#x44F;&#x446;&#x456;&#x44F;</h2>
<p>&#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x444;&#x430;&#x439;&#x43B;&#x443; <strong><code>helloname.rb</code></strong> &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x439;:</p>
<pre><code class="lang-ruby">puts(<span class="hljs-string">&quot;Hello <span class="hljs-subst">#{name}</span>&quot;</span>)
</code></pre>
<p>&#x422;&#x443;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>name</code> &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x435;&#x431;&#x435; &#x432; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x426;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x43C;&#x456;&#x436; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438;, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x441;&#x442;&#x43E;&#x457;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x440;&#x435;&#x448;&#x456;&#x442;&#x43A;&#x438; <code>#{}</code>. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x201C;&#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;&#x201D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x445; &#x437; &#x43F;&#x43E;&#x434;&#x432;&#x456;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43B;&#x430;&#x43F;&#x43A;&#x430;&#x43C;&#x438;.</p>
<p>&#x412; &#x43F;&#x43E;&#x434;&#x432;&#x456;&#x439;&#x43D;&#x438;&#x445; &#x43B;&#x430;&#x43F;&#x43A;&#x430;&#x445; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x456; &#x43D;&#x435;&#x432;&#x438;&#x434;&#x438;&#x43C;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; <code>&quot;\n&quot;</code> &#x442;&#x430; &#x442;&#x430;&#x431;&#x456;&#x432; <code>&quot;\t&quot;</code>.</p>
<p>&#x412;&#x438; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x430;&#x431;&#x43E; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;. &#x423;&#x44F;&#x432;&#x456;&#x43C;&#x43E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>showname</code> &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x201C;Fred&#x201D;. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x43E;&#x43B;&#x44F;&#x446;&#x456;&#x44E; &#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>showname</code> &#x456;, &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x201C;Hello Fred&#x201D;:</p>
<p><strong><code>string_eval.rb</code></strong>:</p>
<pre><code class="lang-ruby">puts <span class="hljs-string">&quot;Hello <span class="hljs-subst">#{showname}</span>&quot;</span>
</code></pre>
<p>&#x423;&#x432;&#x430;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x43F;&#x43E;&#x434;&#x443;&#x43C;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;:</p>
<pre><code class="lang-ruby">puts <span class="hljs-string">&quot;\n\t<span class="hljs-subst">#{(<span class="hljs-number">1</span> + <span class="hljs-number">2</span>) * <span class="hljs-number">3</span>}</span>&quot;</span>
</code></pre>
<p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x456;&#x442;&#x44C; &#x444;&#x430;&#x439;&#x43B; <strong>string_eval.rb</strong> &#x456; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x442;&#x435;, &#x447;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x432;&#x438; &#x440;&#x430;&#x446;&#x456;&#x44E;.</p>
<blockquote>
<h2 id="&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x456;">&#x41A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x456;</h2>
<p>&#x420;&#x44F;&#x434;&#x43A;&#x438;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x440;&#x435;&#x448;&#x456;&#x442;&#x43A;&#x438; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; Ruby &#x44F;&#x43A; &#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x456; (&#x442;&#x43E;&#x431;&#x442;&#x43E; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x457;&#x445; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454;):</p>
<pre><code class="lang-ruby"><span class="hljs-comment"># &#x426;&#x435; &#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;</span>
</code></pre>
</blockquote>
<h2 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h2>
<p>&#x423; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x44F; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; Ruby &#x431;&#x435;&#x437; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x44C; &#x442;&#x430; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x435;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;, &#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x454; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434;. &#x417;&#x430;&#x440;&#x430;&#x437; &#x44F; &#x432;&#x438;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44E; &#x441;&#x432;&#x43E;&#x44E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</p>
<p>&#x41C;&#x438; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x43C;&#x43E; &#x446;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x454; &#x448;&#x43B;&#x44F;&#x445; (&#x43C;&#x435;&#x442;&#x43E;&#x434;) &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430;. &#x412; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x456;&#x457; &#x41E;&#x41E;&#x41F;, &#x432;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; &#x437; &#x43F;&#x440;&#x43E;&#x445;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C;. &#x423;&#x44F;&#x432;&#x456;&#x43C;&#x43E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x454; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x437; &#x456;&#x43C;&#x435;&#x43D;&#x435;&#x43C; <code>ob</code> &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>saysomething</code>. &#x41E;&#x441;&#x44C; &#x442;&#x430;&#x43A; &#x432;&#x438; &#x431; &#x432;&#x438;&#x432;&#x435;&#x43B;&#x438; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>saysomething</code>:</p>
<p><strong><code>object.rb</code></strong>:</p>
<pre><code class="lang-ruby">ob.saysomething
</code></pre>
<p>&#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>saysomething</code> &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-ruby"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">saysometing</span></span>
    puts(<span class="hljs-string">&quot;hello&quot;</span>)
<span class="hljs-keyword">end</span>
</code></pre>
<p>&#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43D;&#x430;&#x434;&#x456;&#x448;&#x43B;&#x435;&#x442;&#x435; &#x434;&#x43E; <code>ob</code> &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; <code>saysomething</code>, &#x432;&#x456;&#x43D; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>saysomething</code> &#x442;&#x430; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x201C;hello&#x201D;.</p>
<p>&#x413;&#x430;&#x440;&#x430;&#x437;&#x434;, &#x43E;&#x441;&#x44C; &#x446;&#x435; &#x456; &#x454; &#x43E;&#x43F;&#x438;&#x441; &#x446;&#x438;&#x445; &#x440;&#x435;&#x447;&#x435;&#x439; &#x443; &#x441;&#x442;&#x438;&#x43B;&#x456; &#x201C;&#x447;&#x438;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x41E;&#x41E;&#x41F;&#x201D;. &#x423; &#x201C;&#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x447;&#x438;&#x441;&#x442;&#x43E;&#x43C;&#x443;&#x201D; &#x41E;&#x41E;&#x41F; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x438;&#x442;&#x438; &#x442;&#x430;&#x43A;: <code>saysomething</code> &#x454; &#x447;&#x438;&#x43C;&#x43E;&#x441;&#x44C; &#x43D;&#x430; &#x437;&#x440;&#x430;&#x437;&#x43E;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x430; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x430; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x456; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;: <code>ob.saysomething</code>.</p>
<p><strong><code>method.rb</code></strong>:</p>
<p>&#x423; Ruby, &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>def</code>, &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x43D;&#x430;&#x437;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x43E;&#x457; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x438;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-ruby"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">showstring</span></span>
    puts( <span class="hljs-string">&quot;Hello&quot;</span> )
<span class="hljs-keyword">end</span>
</code></pre>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x430;&#x437;&#x432;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x431;&#x43E; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x438;&#x432;&#x448;&#x438; &#x457;&#x445; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;:</p>
<pre><code class="lang-ruby"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">showname</span><span class="hljs-params">(a_name)</span></span>
    puts(<span class="hljs-string">&quot;Hello <span class="hljs-subst">#{a_name}</span>&quot;</span>)
<span class="hljs-keyword">end</span>
</code></pre>
<pre><code class="lang-ruby"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">return_name</span><span class="hljs-params">(a_firstName, a_secondName)</span></span>
    <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello <span class="hljs-subst">#{a_firstName}</span> <span class="hljs-subst">#{a_secondName}</span>&quot;</span>
<span class="hljs-keyword">end</span>
</code></pre>
<p>&#x42F;&#x43A; &#x456; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x434;&#x43B;&#x44F; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;&#x441;&#x442;&#x456;, &#x44F; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x438;&#x43C;&#x443; &#x443; &#x441;&#x432;&#x43E;&#x454;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x457;&#x445;, &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x430;&#x436;&#x430;&#x454;&#x442;&#x435;.</p>
<p><strong><code>mainob.rb</code></strong>:</p>
<blockquote>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x44F;&#x43A;&#x438;&#x43C;&#x43E;&#x441;&#x44C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430;&#x43C;, &#x44F;&#x43A; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437; <code>ob</code>, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x442;&#x43E;&#x44F;&#x442;&#x44C; &#x432; &#x43A;&#x43E;&#x434;&#x456;? &#x42F;&#x43A; &#x44F; &#x432;&#x436;&#x435; &#x43A;&#x430;&#x437;&#x430;&#x432; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, Ruby &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>main</code>, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443; &#x456; &#x441;&#x430;&#x43C;&#x435; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x43E; &#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x432; &#x43A;&#x43E;&#x434;&#x456; &#x456; &#x43D;&#x435; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; &#x443; &#x43A;&#x43E;&#x434;&#x456; &#x432;&#x430;&#x448;&#x43E;&#x457; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;.</p>
</blockquote>
<h2 id="&#x447;&#x438;&#x441;&#x43B;&#x430;">&#x427;&#x438;&#x441;&#x43B;&#x430;</h2>
<p>&#x427;&#x438;&#x441;&#x43B;&#x430; &#x43D;&#x430;&#x441;&#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x436; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x44F;&#x43A; &#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438;. &#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x456;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x443;, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x441;&#x443;&#x43C;&#x443; &#x437; &#x432;&#x440;&#x430;&#x445;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432; &#x447;&#x438; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;.</p>
<p>&#x429;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x446;&#x456;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x443; (subtotal) &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x442;&#x438; &#x432;&#x430;&#x440;&#x442;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x443; &#x43D;&#x430; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43D;&#x43E;&#x440;&#x43C;&#x438; (taxrate) &#x442;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x443; &#x432;&#x430;&#x440;&#x442;&#x456;&#x441;&#x442;&#x44C; (&#x432;&#x438;&#x442;&#x440;&#x430;&#x442;&#x438;). &#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x446;&#x456;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x443; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454; $100, &#x430; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43E;&#x43A; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454; 17.5%, &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x440;&#x430;&#x445;&#x443;&#x454; &#x456; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;:</p>
<pre><code class="lang-ruby">subtotal = <span class="hljs-number">100.00</span>
taxrate = <span class="hljs-number">0</span>.<span class="hljs-number">175</span>
tax = subtotal * taxrate
puts <span class="hljs-string">&quot;Tax on $<span class="hljs-subst">#{subtotal}</span> is $<span class="hljs-subst">#{tax}</span>, so grand total is $<span class="hljs-subst">#{subtotal+tax}</span>&quot;</span>
</code></pre>
<p>&#x417;&#x432;&#x456;&#x441;&#x43D;&#x43E;, &#x43A;&#x440;&#x430;&#x449;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x438; &#x43D;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x434;&#x430;&#x445; &#x446;&#x456;&#x43D; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x443;, &#x43D;&#x456;&#x436; &#x43D;&#x430; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x443; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x456; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x434;&#x443; &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x456; &#x437;&#x43D;&#x43E;&#x432;&#x443;. &#x41E;&#x441;&#x44C; &#x43D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x443; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432;, &#x44F;&#x43A;&#x430; &#x43D;&#x430;&#x433;&#x430;&#x434;&#x443;&#x454; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x435;&#x432;&#x456; &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x446;&#x456;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x443;:</p>
<pre><code class="lang-ruby">taxrate = <span class="hljs-number">0</span>.<span class="hljs-number">175</span>
print <span class="hljs-string">&quot;Enter price (ex tax): &quot;</span>
s = gets
subtotal = s.to_f
tax = subtotal * taxrate
puts <span class="hljs-string">&quot;Tax on $<span class="hljs-subst">#{subtotal}</span> is $<span class="hljs-subst">#{tax}</span>, so grand total is $<span class="hljs-subst">#{subtotal+tax}</span>&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; <code>.to_f</code> &#x2014; &#x446;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>String</code>. &#x412;&#x456;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x432; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437; &#x43F;&#x43B;&#x430;&#x432;&#x430;&#x44E;&#x447;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>&quot;s&quot;</code> &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x447;&#x438;&#x441;&#x43B;&#x43E; <code>145.5</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x443; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x43F;&#x43B;&#x430;&#x432;&#x430;&#x44E;&#x447;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;  - &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x43D;&#x430;&#x43C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>0.0</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, <code>&quot;Hello world&quot;.to_f</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; <code>0.0</code></p>
<h2 id="&#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430;-&#x443;&#x43C;&#x43E;&#x432;&#x438;-if--then">&#x41F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x443;&#x43C;&#x43E;&#x432;&#x438;: <code>if ... then</code></h2>
<p>&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x437; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x447;&#x435;&#x43C; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443;, &#x43A;&#x43E;&#x434; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E; &#x432;&#x438;&#x449;&#x435;, &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x2019;&#x454;&#x43C;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43D;&#x456; &#x441;&#x443;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x438;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x2019;&#x454;&#x43C;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443; &#x2014; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x430; &#x43D;&#x430;&#x432;&#x440;&#x44F;&#x434;&#x447;&#x438; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x433;&#x456;&#x434;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x443;&#x440;&#x44F;&#x434;&#x443;! &#x422;&#x43E;&#x43C;&#x443; &#x43C;&#x435;&#x43D;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x43D;&#x443;&#x441;&#x430; &#x443; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456;&#x439;, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x457;&#x43C; &#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x44C; &#x43E;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x43C;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;:</p>
<p><strong><code>tax_calculator.rb</code></strong>:</p>
<pre><code class="lang-ruby">taxrate = <span class="hljs-number">0</span>.<span class="hljs-number">175</span>
print <span class="hljs-string">&quot;Enter price (ex tax): &quot;</span>
s = gets
subtotal = s.to_f
<span class="hljs-keyword">if</span> (subtotal &lt; <span class="hljs-number">0</span>.<span class="hljs-number">0</span>) <span class="hljs-keyword">then</span>
    subtotal = <span class="hljs-number">0</span>.<span class="hljs-number">0</span>
<span class="hljs-keyword">end</span>
tax = subtotal * taxrate
puts <span class="hljs-string">&quot;Tax on $<span class="hljs-subst">#{subtotal}</span> is $<span class="hljs-subst">#{tax}</span>, so grand total is $<span class="hljs-subst">#{subtotal+tax}</span>&quot;</span>
</code></pre>
<p>&#x412; Ruby &#x443;&#x43C;&#x43E;&#x432;&#x430; <code>if</code> &#x441;&#x445;&#x43E;&#x436;&#x430; &#x43D;&#x430; <code>if</code>&#x2013;&#x443;&#x43C;&#x43E;&#x432;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x437;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x454; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>then</code>. &#x422;&#x438;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x448;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x431; &#x432;&#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x431;&#x435;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x443; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x443;&#x43C;&#x43E;&#x432;&#x438;, &#x442;&#x43E;&#x434;&#x456; <code>then</code> &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E;.</p>
<pre><code class="lang-ruby"><span class="hljs-keyword">if</span> (subtotal &lt; <span class="hljs-number">0</span>.<span class="hljs-number">0</span>) <span class="hljs-keyword">then</span> subtotal = <span class="hljs-number">0</span>.<span class="hljs-number">0</span> <span class="hljs-keyword">end</span>
</code></pre>
<p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>end</code>, &#x44F;&#x43A;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x431;&#x43B;&#x43E;&#x43A; <code>if</code> &#x454; <em>&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C;</em>. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x439;&#x43E;&#x433;&#x43E;, &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43D;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F;.</p>
<blockquote>
<p><strong>&#x41F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x43A;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x447;&#x430;</strong></p>
<p>&#x426;&#x44E; &#x441;&#x430;&#x43C;&#x443; &#x443;&#x43C;&#x43E;&#x432;&#x438; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-ruby">subtotal = <span class="hljs-number">0</span>.<span class="hljs-number">0</span> <span class="hljs-keyword">if</span> subtotal &lt; <span class="hljs-number">0</span>.<span class="hljs-number">0</span>
</code></pre>
<p>&#x2026; &#x430;&#x431;&#x43E; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-ruby">subtotal = <span class="hljs-number">0</span>.<span class="hljs-number">0</span> <span class="hljs-keyword">unless</span> (subtotal &gt; <span class="hljs-number">0</span>.<span class="hljs-number">0</span>) || (subtotal == <span class="hljs-number">0</span>)
</code></pre>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="00-Introduction.html" class="navigation navigation-prev " aria-label="Previous page: Вступ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02-Classes-and-Objects.html" class="navigation navigation-next " aria-label="Next page: Глава 2: Класи та об’єкти">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 1: Рядки та методи","level":"1.3","depth":1,"next":{"title":"Глава 2: Класи та об’єкти","level":"1.4","depth":1,"path":"chapters/02-Classes-and-Objects.md","ref":"chapters/02-Classes-and-Objects.md","articles":[]},"previous":{"title":"Вступ","level":"1.2","depth":1,"path":"chapters/00-Introduction.md","ref":"chapters/00-Introduction.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","ga","rss","github-buttons"],"pluginsConfig":{"github":{"url":"https://github.com/LambdaBooks/thelittlebookofruby"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Маленька книга про Ruby","description":"Український переклад книги «The Little Book Of Ruby».","author":"Denys Dovhan","site_url":"http://lambdabooks.github.io/thelittlebookofruby","feed_url":"http://lambdabooks.github.io/thelittlebookofruby/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/thelittlebookofruby","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-8"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/thelittlebookofruby/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapters/01-Strings-and-Methods.md","mtime":"2017-02-28T21:03:48.584Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-28T21:05:14.423Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

